In [31]:
# How would you fill missing values in the 'Age' column with the mean age of all non-missing values?

import pandas as pd 
import numpy as np 

df = pd.DataFrame({ 'Name': ['Alice', 'Bob', None, 'David', 'Eve'], 'Age': [25, None, 35, 40, None], 'Salary': [50000, 60000, None, 70000, 55000] })

df["Age"] = df['Age'].fillna(int(df['Age'].mean()))
df

df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob  33.0  60000.0
2   None  35.0  58750.0
3  David  40.0  70000.0
4    Eve  33.0  55000.0